Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་དང་ལྡན་པའི་བུད་མེད་ཀྱི་ཚོགས་ལ་རྣམ་པར་བལྟས་པ་དང་། ཁ་ཅིག་ནི་གོས་ལྷུང་བར་གྱུར། ཁ་ཅིག་ནི་སྐྲ་ཞིག །ཁ་ཅིག་ནི་རྒྱན་བྲུལ། ཁ་ཅིག་ནི་ཅོད་པན་ལྷུང་།
en: When the Bodhisattva looked at the entire retinue of women, he saw that some had garments that had slipped off, some had disheveled hair, and some had their jewelry in disarray.

source: ཁ་ཅིག་ནི་ཕྲག་པ་མི་སྡུག་པར་གྱུར། ཁ་ཅིག་ནི་ལུས་རྣམ་པར་འཁྲུགས།
en: Others had lost their head ornaments, some had ugly shoulders, while some had uncovered arms and legs.

source: ཁ་ཅིག་ནི་བཞིན་མི་སྡུག་པར་གནས། ཁ་ཅིག་ནི་མིག་གྱུར།
en: Some had repulsive expressions, while the eyes of others were crossed.

source: ཁ་ཅིག་ནི་ཁ་ཆུ་ཟག །ཁ་ཅིག་ནི་སྔུར།
en: Some were drooling, and others were snoring.

source: ཁ་ཅིག་ནི་ལུད་པ་ལུ། ཁ་ཅིག་ནི་རྒོད། ཁ་ཅིག་ནི་བརྡོལ།
en: Some were laughing wildly, some were coughing, and others were prattling incoherently.

source: ཁ་ཅིག་ནི་སོ་འཁྲིག །ཁ་ཅིག་ནི་བཞིན་མདོག་གྱུར།
en: Some others were gnashing their teeth, and the complexion of others had changed.

source: ཁ་ཅིག་ནི་གཟུགས་མི་སྡུག་པར་གྱུར་ཏེ། ལག་པ་རིང་པོར་གྱུར།
en: Some of the women had unpleasant features, such as arms that were too long.

source: ཁ་ཅིག་ནི་རྐང་པ་ཕྲལ།
en: Some tossed their feet around.

source: ཁ་ཅིག་ནི་མགོ་ཕྱུང་། ཁ་ཅིག་ནི་མགོ་གཡོགས།
en: Some had their heads uncovered, while the heads of others were covered.

source: ཁ་ཅིག་ནི་བཞིན་གྱི་དབྱིབས་གྱུར།
en: The facial features of some had changed.

source: ཁ་ཅིག་ནི་ལུས་མ་རུངས་པར་གྱུར། ཁ་ཅིག་ནི་ལུས་སྒྲེན་མོར་གྱུར།
en: The bodies of some looked awful, and some were even lying naked.

source: ཁ་ཅིག་ནི་ལུས་བསྐུམས་ཤིང་སྔུར།
en: Some were hunched over and making gargling sounds.

source: ཁ་ཅིག་ནི་རྫ་རྔ་ལ་འཁྱུད་ནས་ལུས་གན་རྐྱལ་དུ་འགྱེལ།
en: Some, still holding clay kettledrums, were twisting their bodies and heads.

source: ཁ་ཅིག་ནི་པི་བང་དང་རྒྱུད་གསུམ་པའི་སྟེང་དུ་ལག་པ་བརྐྱང་།
en: Some of the women held their instruments, such as lutes and three-stringed lutes.

source: ཁ་ཅིག་ནི་གླིང་བུ་ལ་སོས་འདེབས།
en: Others were grinding their flutes with their teeth, making crushing noises.

source: ཁ་ཅིག་ནི་རོལ་མོའི་ཆ་བྱད་ཀིམ་པ་ལ་དང་། ན་ཀུ་ལ་དང་། ཁར་བའི་སིལ་ཁྲོལ་དང་། ཕེག་ལ་འཛིན།
en: Some were playing kimpalas, nakalus, and sampas whose resonance boxes had been removed.

source: ཁ་ཅིག་ནི་མིག་འཛུམས་ཤིང་འབྱེད་ལ་འགྱུར།
en: Some had their eyes closed, some had them open, and some were rolling their eyes.

source: ཁ་ཅིག་ནི་ཁ་གདངས་པར་གྱུར་ཏེ།
en: Some of the women were also lying with their mouths agape.

source: དེ་ལྟར་ས་ལ་མི་སྡུག་པར་གནས་པར་གྱུར་པའི་བཙུན་མོའི་འཁོར་ལ་ལྟ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་དུར་ཁྲོད་ཀྱི་འདུ་ཤེས་སྐྱེད་དོ།
en: The Bodhisattva looked at the retinue of consorts, who were lying there on the floor looking utterly revolting, and he had the impression that he was indeed in a cemetery.

source: འཇིག་རྟེན་མགོན་དེས་དེ་མཐོང་ཡིད་བྱུང་སྟེ།
en: Seeing this, the Protector of the World felt upset.

source: །སྙིང་རྗེས་ཤུགས་ཕྱུང་ནས་ནི་འདི་སྐད་སྨྲས།
en: With an outpouring of compassion he exclaimed,

source: །ཨེ་མ་སྐྱེ་དགུ་དག་ནི་སྡུག་བསྔལ་གྱུར།
en: “Ah! This gathering is so miserable!

source: །སྲིན་མོའི་ཚོགས་ལ་དགའ་བ་ཇི་ལྟར་རྙེད། །
en: How could I find delight in this assembly of demonesses?

source: འདོད་པའི་ཡོན་ཏན་ཡོད་མིན་ཡོན་ཏན་འཛིན། །གཏི་མུག་མུན་པས་རབ་བསྒྲིབས་བློ་གྲོས་ངན།
en: “Flawed and obscured with delusion is the judgment Of he who thinks that worthless sense pleasures are meaningful.

source: །དཔེར་ན་བྱ་ནི་བྱ་རྒྱར་ཆུད་པ་བཞིན།
en: Like a bird caught in a cage,

source: །ནམ་ཡང་འབྱུང་བ་རྙེད་པར་འགྱུར་མ་ཡིན།། །།
en: One never regains one’s freedom.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ཆོས་སྣང་བའི་སྒོ་འདིས་ཡང་བཙུན་མོའི་འཁོར་ལ་རྟོག་ཅིང་སྙིང་རྗེ་ཆེན་པོའི་སྨྲེ་བས་སེམས་ཅན་གྱི་ཕྱིར་སྨྲེ་སྟེ།
en: Then the Bodhisattva examined his retinue of women by means of this gateway to the light of the Dharma. Next, with words spoken out of great compassion, he lamented sentient beings:

source: འདི་ན་བྱིས་པ་དེ་དག་ནི་གསོད་པ་སྟེ། བསད་པའི་གནས་སུ་གསད་པར་བྱ་བ་གསོད་པ་དང་མཚུངས་སོ།
en: “These childish beings are killed, like the condemned at the scaffold.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཆགས་པ་སྟེ། ངན་སྐྱུགས་ཀྱིས་གང་བའི་སྣོད་རི་མོ་ཅན་རྣམས་ལ་མི་མཁས་པ་ཆགས་པ་དང་མཚུངས་སོ།
en: These childish beings are filled with desire, like fools who are attracted to a ceramic vase filled with vomit.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་འབྱིང་བ་སྟེ། གླང་པོ་ཆེ་ཆུར་བྱིང་བ་དང་མཚུངས་སོ།
en: These childish beings are drowning, like elephants sinking in deep water.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་བཙས་པ་སྟེ། བཙོན་རའི་ནང་གི་བཙོན་བཙས་པ་དང་མཚུངས་སོ།
en: These childish beings are confined, like thieves in a dungeon.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་མངོན་པར་དགའ་བ་སྟེ། ཕག་མི་གཙང་བ་ལ་དགའ་བ་དང་མཚུངས་སོ།
en: These childish beings are content, like a pig surrounded by filth.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཆགས་པ་སྟེ། ཁྱི་ཀེང་རུས་ལ་ཆགས་པ་དང་མཚུངས་སོ།
en: These childish beings are greedy, like a dog with a bone.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་རབ་ཏུ་ལྷུང་བ་སྟེ། ཕྱེ་མ་ལེབ་མར་མེའི་མེ་ལྕེར་ལྷུང་བ་དང་མཚུངས་སོ།
en: These childish beings fall, like moths flying into the candle flame.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཐོགས་པ་སྟེ། སྤྲེའུ་རྙོང་ལ་ཐོགས་པ་དང་མཚུངས་སོ།
en: These childish beings are trapped, like a monkey tangled in a snare.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཡོངས་སུ་བཟུང་བ་སྟེ། ཉ་རྒྱས་ཟིན་པ་དང་མཚུངས་སོ།
en: These childish beings are caught, like fish snarled in a net.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཡོངས་སུ་གཏུབས་པ་སྟེ། ཤ་འཚོང་གི་གནས་ཀྱི་ལུག་དང་མཚུངས་སོ།
en: These childish beings are cut up, like sheep on a slaughtering log.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་བཙུགས་པ་སྟེ་སྡིག་པ་བྱེད་པ་གསལ་ཤིང་གི་རྩེ་མོ་ལ་བཙུགས་པ་དང་མཚུངས་སོ།
en: These childish beings are impaled, like a criminal on the tip of a stake.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་འདམ་དུ་འབྱིང་ཞིང་ཐོགས་པ་སྟེ། གླང་པོ་ཆེ་རྒན་པོ་འདམ་དུ་སོང་བ་དང་མཚུངས་སོ།
en: These childish beings are sinking, like an old elephant in a swamp.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཕོངས་པ་སྟེ། རྒྱ་མཚོ་ཆེན་པོར་གྲུའི་སྣམ་བུ་ཞིག་པ་དང་མཚུངས་སོ།
en: These childish beings perish, like a ship wrecked on the ocean.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་རབ་ཏུ་ལྷུང་བ་སྟེ། དམུས་ལོང་གཡང་ས་ཆེན་པོར་ལྷུང་བ་དང་མཚུངས་སོ།
en: These childish beings fall, like a blind person tumbling into a deep abyss.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཡོངས་སུ་ཟད་པར་འགྱུར་བ་སྟེ། སའི་སྟེང་གི་མཚམས་སུ་སོང་བའི་ཆུ་དང་མཚུངས་སོ།
en: These childish beings are exhausted, like water running into the surface of the earth.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་དུ་བ་འཐུལ་བ་སྟེ། བསྐལ་པ་ཟད་པའི་ས་ཆེན་པོ་དང་མཚུངས་སོ།
en: These childish beings go up in smoke, like this great earth at the end of the eon.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་འཁོར་བ་སྟེ། རྫ་མཁན་གྱི་འཁོར་ལོའི་ཤུགས་དང་མཚུངས་སོ།
en: These childish beings are spinning, like the revolving of a potter’s wheel.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་འབྲོག་རྩོལ་བ་སྟེ། དམུས་ལོང་རི་ལ་ཕྱིན་པ་དང་མཚུངས་སོ།
en: These childish beings have lost their way, like blind people roaming the mountains.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་བཏགས་ཤིང་འཁོར་བ་སྟེ། ཁྱི་ལྟོང་གིས་བཏགས་པ་དང་མཚུངས་སོ།
en: These childish beings are tied up and run in circles, like dogs kept on a leash.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་རྙིས་པ་སྟེ། དཔྱིད་ཀྱི་རྩྭ་དང་ནགས་ཚལ་དང་མཚུངས་སོ།
en: These childish beings wither, like grasses and trees in the hot season.

source: །འདི་ན་བྱིས་པ་དེ་དག་ནི་ཡོངས་སུ་ཉམས་པ་སྟེ། ཟླ་བ་མར་གྱི་ངོའི་ཟླ་བ་དང་མཚུངས་སོ།
en: These childish beings diminish, like the waning moon during the dark fortnight.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ལ་ཟབ་སྟེ། ཀླུ་ལ་ནམ་མཁའ་ལྡིང་དང་མཚུངས་སོ།
en: These childish beings are devoured, like snakes by the garuḍas.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ལ་འཆའ་བ་སྟེ། གྲུ་བོ་ཆེ་ལ་ཆུ་སྲིན་ཆེན་པོ་དང་མཚུངས་སོ།
en: These childish beings are swallowed, like ships by huge sea monsters.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ལ་འཇོམས་པ་སྟེ། འདྲོན་པོ་ལ་ཆོམ་པོ་མང་པོ་དང་མཚུངས་སོ།
en: These childish beings are robbed, like a traveler by a horde of thieves.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ལ་འཇིག་པ་སྟེ། ཤིང་སཱ་ལ་ལ་རླུང་མར་ཆེན་པོ་དང་མཚུངས་སོ།
en: These childish beings are broken, like palm trees in a storm.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ལ་གསོད་པ་སྟེ། སྐྱེ་བོ་ལ་སྦྲུལ་མིག་གདུག་པ་དང་མཚུངས་སོ།
en: These childish beings are killed, like someone bitten by a poisonous snake.

source: །བྱིས་པ་རྣམས་ནི་རོ་མྱང་བའི་འདུ་ཤེས་ཀྱིས་ཆོད་པ་སྟེ། རལ་གྲིའི་སོ་སྦྲང་རྩིས་བསྐུས་པས་ཆོད་པ་བཞིན་ནོ།
en: These childish beings are wounded because of seeking a taste, like fools licking a knife smeared with honey.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ཁྱེར་བ་སྟེ། ཤིང་གི་ཕུང་པོ་ཆུ་བོའི་ཆུས་ཁྱེར་བ་དང་མཚུངས་སོ།
en: These childish beings are carried away, like wooden logs taken off by the river.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ལ་རྩེད་པ་སྟེ། བྱིས་པ་ཆུང་ངུ་རང་གི་གཅིན་རྟུག་ལ་རྩེ་བ་དང་མཚུངས་སོ།
en: These childish beings play, like children toying with their own excrement.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ཀུན་ཏུ་སྒྱུར་བ་སྟེ། གླང་པོ་ཆེ་ལ་ལྕགས་ཀྱུ་དང་མཚུངས་སོ།
en: These childish beings are controlled, like elephants by the mahout’s hook.

source: །འདི་དག་ནི་བྱིས་པ་རྣམས་ལ་སླུ་བ་སྟེ། གཡོན་ཅན་གྱིས་བྱིས་པའི་རང་བཞིན་ཅན་དག་བྲིད་པ་བཞིན་ནོ།
en: These childish beings are deceived, like a simple-minded person by a charlatan.

source: །འདི་དག་ནི་བྱིས་པ་དེ་དག་གི་དགེ་བའི་རྩ་བ་ཟད་པར་བྱེད་པ་སྟེ། རྒྱན་པོ་ལ་དགའ་བའི་ནོར་དང་མཚུངས་སོ།
en: These childish beings exhaust their roots of virtue, like a gambler losing his wealth.

source: །འདི་དག་གིས་བྱིས་པ་རྣམས་འཆོས་པ་སྟེ། སྲིན་མོ་རྣམས་ཀྱིས་ཚོང་བ་འཆོས་པ་དང་མཚུངས་སོ།
en: These childish beings are devoured, like merchants consumed by demonesses.”

source: །བྱང་ཆུབ་སེམས་དཔས་རྣམ་པ་སུམ་ཅུ་རྩ་གཉིས་པོ་འདི་དག་གིས་བཙུན་མོའི་འཁོར་ལ་ཡོངས་སུ་བརྟག་པ་བྱས་ནས།
en: The Bodhisattva examined the retinue of consorts by means of these thirty-two similes.

source: ལུས་ལ་མི་གཙང་བའི་འདུ་ཤེས་རྣམ་པར་སྒོམ། མི་འཐུན་པའི་འདུ་ཤེས་ཉེ་བར་སྒྲུབ།
en: He contemplated the impure nature of the body and developed a feeling of repulsion, and then disgust.

source: སྨད་པའི་འདུ་ཤེས་སྐྱེད། རང་གི་ལུས་ལ་ཡང་དེ་དང་འདྲ་བར་རྣམ་པར་སྒོམ། ལུས་ཀྱི་ཉེས་དམིགས་ཡང་དག་པར་མཐོང་།
en: Next he meditated the fact that his own body was just like theirs, and so he truly saw the shortcomings of the physical body.

source: ལུས་ལ་ལུས་སུ་མངོན་པར་ཞེན་པ་ལས་སྐྱོད། སྡུག་པའི་འདུ་ཤེས་རྣམ་པར་འཇིག །མི་སྡུག་པའི་འདུ་ཤེས་འཇུག་པར་བྱེད།
en: Then he let go of his attachment toward the body, destroying his perception of it as being attractive and instead seeing it as repulsive.

source: འོག་གི་རྐང་པའི་མཐིལ་ནས་སྟེང་གི་ཀླད་པ་མན་ཆད་མི་གཙང་བ་ལས་བྱུང་བ་དང་། མི་གཙང་བ་ལས་གྱུར་པ་དང་། རྟག་ཏུ་མི་གཙང་བ་ཟག་པར་མཐོང་ངོ་།
en: He saw that the body, from the soles of the feet all the way up to the top of the head, is made of filth, produces filth, and emits filth.

source: །ལུས་ཀྱི་ཞིང་ལས་སྐྱེས་ཤིང་སྲེད་པའི་ཆུ་ལས་བྱུང་བ་འཇིག་ཚོགས་མིང་དུ་བཏགས།
en: “Grown in the fields of karma and born from the water of craving, we call it the transitory body.

source: །མཆི་མ་རྡུལ་དང་མཆིལ་མས་བརླན་ལ་གཅིན་གྱིས་བསྒྱུར་ཅིང་ཁྲག་གི་ཐིགས་པས་གང་།
en: This body is moist from tears, sweat, and mucus, and filled with urine and blood.

source: །ཞག་དང་རྣག་དང་ལྒང་བ་དང་ནི་ཀླད་རྒྱས་དག་དང་སྡིག་པ་རྣམས་ཀྱིས་གང་།
en: It is full of all kinds of filth, fat, pus, and brains;

source: །རྟག་ཏུ་ངན་སྐྱུགས་ཟག་ཅིང་ཀུན་ཀྱང་དྲི་མ་རྣམ་པ་སྣ་ཚོགས་ཐ་དད་པ།
en: It constantly leaks excrement and it stinks.

source: །པགས་པ་སོ་དང་སྐྲ་དང་སྤུ་ཡིས་བསྒྱུར་ཅིང་པགས་པས་གཡོགས་ལ་སྤུ་དང་ལྡན།
en: “It is made of bones, teeth, and hair, and is covered by a hairy skin;

source: །རྒྱུ་མ་མཆིན་པ་མཚེར་པ་ཆུ་སེར་ཁ་ཆུ་འདི་དག་བསགས་པ་ཉམ་ཆུང་བ།
en: Packed with intestines, liver, spleen, lymph, and saliva, it is weak.

source: །རྐང་དང་ཆུ་རྒྱུས་དག་གིས་སྦྲེལ་ཏེ་འཁྲུལ་འཁོར་འདྲ་ཞིང་ཤ་ཡིས་མཛེས་པར་བྱས།
en: It is like a machine held together by bones and sinew and adorned with flesh;

source: །སྣ་ཚོགས་ནད་ཀྱིས་གང་ཞིང་མྱ་ངན་ཁྱབ་ལ་བཀྲེས་དང་སྐོམ་པས་ཀུན་ཏུ་ཉེན།
en: It is filled with diseases, subject to pain, and always afflicted by hunger and thirst.

source: །སྐྱེ་བ་པོ་དག་ལུས་ནི་བུ་ག་མང་ཞིང་འཆི་དང་རྒ་བའི་གནས་གྱུར་པ།
en: “The body of beings has many cavities and transforms into old age and death.

source: །མཐོང་ནས་མཁས་པ་སུ་ཞིག་རང་གི་ལུས་ལ་དགྲ་དང་མཚུངས་པར་སེམས་མི་འགྱུར།
en: Seeing the body, what wise person would not think of it as an enemy?”

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ལ་ལུས་སུ་སོང་བའི་དྲན་པས་གནས་པར་གྱུར་ཏོ།
en: In this way the Bodhisattva remained mindful of the body as something that must be left behind.

source: །ནམ་མཁའི་དཀྱིལ་ན་འཁོད་པའི་ལྷའི་བུ་རྣམས་ཀྱིས་ལྷའི་བུ་ཆོས་སྤྱོད་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The gods, who were hovering in the sky above, asked the god Dharmacārin,

source: །གྲོགས་པོ་དོན་གྲུབ་འདི་ནི་བཙུན་མོའི་འཁོར་ལ་རྣམ་པར་ལྟ་ཞིང་འཛུམ་ཡང་སྟོན།
en: “Dear friend, what is this? Siddhārtha dawdles and keeps looking at the retinue of consorts.

source: །སེམས་ནི་མི་དགའ་མིག་ནི་ཕྱིར་ཞིང་ལྟ་ན་ཕྱི་ཤོལ་བྱེད་དམ་ཅི།
en: He even smiles and does not seem displeased.

source: །ཡང་ན་འདི་ནི་རྒྱ་མཚོའི་ཟབས་དང་མཚུངས་ཏེ་འདི་ཚད་གཟུང་བར་མི་ནུས་སོ།
en: But perhaps he is like a deep ocean that cannot be fathomed?

source: །ཡང་ན་ཆགས་པ་མེད་པ་འདི་ཡུལ་རྣམས་ལ་ཡིད་ཆགས་པར་ནི་མི་འགྱུར་གྲང་།
en: Because isn’t it true that whoever is unattached does not cling to objects?

source: །ལྷ་རྣམས་ཀྱིས་བསྐུལ་བ་ཡི་ཡི་དམ་བརྗེད་པར་མ་གྱུར་གྲང་།
en: Or will he perhaps forget the promise he made when he was inspired by the gods?”

source: །ལྷའི་བུ་ཆོས་སྤྱོད་ཀྱིས་སྨྲས་པ། དེ་སྐད་སྨྲ་ཅི་དགོས།
en: The god Dharmacārin replied, “Why say something like that?

source: འདི་སྔོན་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་ན་ཡང་མངོན་པར་འབྱུང་བ་དང་། གཏོང་བ་ལ་རྣམ་པ་དེ་ལྟ་བུར་ཆགས་པ་མེད་པར་གྱུར་པ་དེ་ཁྱེད་ལ་མངོན་སུམ་དུ་གྱུར་པ་ཡིན་ན།
en: There is surely evidence that when he practiced awakened conduct in the past, he developed this kind of detachment.

source: ད་སྲིད་པ་ཐ་མ་པ་ལ་གནས་པ་ཆགས་པར་མི་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: Why then would he all of a sudden become attached in this existence, which is his last?”

source: དགེ་སློང་དག་དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ངེས་པར་བྱས་པ།
en: Monks, indeed the Bodhisattva had become certain.

source: ཡིད་བྱུང་བར་གྱུར་པ། བློ་བརྟུལ་བ། ཚུལ་དུ་ཤིས་ཤིང་རིངས་ཐབས་མེད་པར་སྐྱིལ་མོ་ཀྲུང་བཤིག་སྟེ། གླུ་དབྱངས་ལེན་པའི་ཁང་བཟངས་ན་ཤར་ཕྱོགས་སུ་ལྟ་ཞིང་འདུག་ནས་ལག་པ་གཡས་པས་རིན་པོ་ཆེའི་དྲ་བ་སྨད་དེ་ཁང་བཟངས་ཀྱི་སྟེང་དུ་སོང་ནས་སོར་མོ་བཅུ་ཐལ་མོ་སྦྱར་ཏེ།
en: He was filled with distaste and had made up his mind. So without any delay, he gracefully rose from his seat in the music hall and turned toward the east. With his right hand he parted the bejeweled lattice and went onto the palace roof.

source: སངས་རྒྱས་ཐམས་ཅད་བསམས་ནས་སངས་རྒྱས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ཏེ།
en: There he folded his hands and, recalling all the buddhas, he bowed to them.

source: ནམ་མཁའི་དཀྱིལ་དུ་བལྟས་པ་དང་དེས་མཐོང་བ། ནམ་མཁའི་དཀྱིལ་ན་ལྷའི་དབང་པོ་མིག་སྟོང་དང་ལྡན་པ་ལྷ་བརྒྱ་སྟོང་གིས་བསྐོར་ཅིང་། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། ཕྱེ་མ་དང་། གོས་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་དང་། མེ་ཏོག་གི་རྣ་རྒྱན་དང་། རིན་པོ་ཆེའི་དོ་ཤལ་གྱི་ཆུན་པོ་ཐོགས་ཏེ།
en: When he looked up into the expanse of space, he saw Indra, the one-thousand-eyed lord of the gods, with a retinue of one hundred thousand gods, holding flowers, incense, garlands, perfumes, scented powder, garments, parasols, victory banners, flags, earrings made of flowers, and garlands made of precious stones.

source: ལུས་བཏུད་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་འདུག་པ་མཐོང་ངོ་།
en: Bowing before him, Indra paid his respect to the Bodhisattva.

source: །འཇིག་རྟེན་སྐྱོང་བ་བཞི་ཡང་གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། དྲི་ཟ་དང་། ཀླུའི་ཚོགས་ཀྱིས་བསྐོར་ཅིང་གོ་ཆ་སྲ་བ་བགོས། ཡ་ལད་བགོས་ཏེ།
en: The Bodhisattva also saw the four guardians of the world together with hordes of yakṣas, demons, gandharvas, and nāgas.

source: རལ་གྲི་དང་། མདའ་གཞུ་དང་། མདུང་ཐུང་དང་། མཚོན་རྩེ་གཉིས་པ་དང་། རྩེ་གསུམ་པ་ལག་ན་ཐོགས་ཤིང་ཚུལ་དུ་ཤིས་པར་ནོར་བུའི་ཅོད་པན་དང་། གཙུག་ཕུད་འཕྱང་བར་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱག་འཚལ་ཞིང་འདུག་པ་མཐོང་ངོ་།
en: They all wore solid armor, corselets, and helmets. In their arms they held swords, bows and arrows, spears, javelins, and tridents. They gracefully took off their bejeweled diadems and crowns and bowed before the Bodhisattva.

source: །ལྷའི་བུ་ཉི་མ་དང་ཟླ་བ་གཉིས་ཀྱང་གློ་གཡས་གཡོས་ན་འདུག་པར་མཐོང་ངོ་།
en: Then he saw two gods, Sūrya and Candra, standing on his right and left sides.

source: །སྐར་མའི་བདག་པོ་རྒྱལ་ཡང་ནམ་ཕྱེད་ན་ཤར་བར་མཐོང་ངོ་།
en: Puṣya, the chief of all constellations, was also seen standing by.

source: །མཐོང་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔས་འདུན་པ་ལ་སྨྲས་པ།
en: Seeing that it was now midnight, the Bodhisattva called upon Chanda:

source: ང་ཡི་བཀྲ་ཤིས་འདི་ནི་དོན་ཀུན་གྲུབ།
en: “All the auspicious signs have come together;

source: །དོ་མོད་གདོན་མི་ཟ་བར་དོན་གྲུབ་ཀྱིས།
en: Without a doubt I will accomplish my wishes tonight.

source: །འདུན་པ་ཕྱི་ཤོལ་མ་བྱེད་ལ་གོར་དུ།
en: Chanda, don’t vacillate or delay!

source: །རྟ་རྒྱལ་རྒྱན་གྱིས་བརྒྱན་པའང་ང་ལ་བྱིན།
en: Ornament the king of horses and bring it bedecked to me.”

source: །དེ་ནས་འདུན་པས་ཚིག་དེ་ཐོས་ནས། ཡིད་མི་དགའ་ཞིང་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When Chanda heard these words, he felt sad and asked: “Where are you going, you who whose eyebrows are long

source: །སྨིན་མ་རིང་ཞིང་པད་མའི་འདབ་མ་རྒྱས་འདྲའི་སྤྱན་མངའ་མི་ཡི་སེང་གེ་སྟོན་ཀའི་ཟླ་བ་ཉ་བ་ལྟ་བུ་དང་། །མེ་ཏོག་ཀུ་མུ་ད་དང་ཟླ་བ་དང་ནི་དགའ་བའི་པད་མའི་རྫིང་བུ་སར་པར་འཇམ་པའི་པད་མ་རྒྱས་འདྲའི་ཞལ།
en: And who has eyes as beautiful as blooming lotuses? A lion among men, with a face like the autumn moon, The moon that delights the lotuses of the night? “Your face is like a blooming white lotus; It is as tender as a young blue lotus.

source: །སྦྱང་པའི་གསེར་དང་ཉི་མ་ཤར་མ་ཐག་དང་ཟླ་བ་དྲི་མེད་གཟི་དང་མར་བླུགས་མེ་ཡི་འོད་འཕྲོ་ནོར་བུ་གློག་འོད་འབར་བའི་གཟི་བརྗིད་ཅན། །གླང་པོ་རྒྱགས་པ་འགྱིང་བའི་གླང་པོའི་སྟོབས་ཅན་བ་ལང་ཁྱུ་མཆོག་རི་དགས་རྒྱལ་དང་ངང་པའི་སྟབས་ཅན་སྟབས་མཛེས་ཤིན་ཏུ་ཞབས་ལེགས་གང་དུ་བཞུད།
en: Your splendor is like that of the sun, or well-purified gold; It is like the newly risen and stainless moon, “Like the fire whose flames are fed by the sacrificial butter. Your splendor is like a blazing flash of lightning; Your invincible gait is as graceful as that of a confident elephant; You walk and place your feet beautifully, with the gait of a bull, a lion, or a swan.”

source: འདུན་པ་གང་གི་དོན་དུ་ང་ཡིས་སྔོན་ཆད་ལག་པ་རྐང་པ་མིག་དང་དེ་བཞིན་མགོ་དང་ལུས་བཏང་ཞིང་།
en: “Chanda, tell me, for what purpose then Have I in the past forsaken my arms and legs and eyes?

source: །ཆུང་མ་དང་ནི་ཕངས་པའི་རྒྱལ་སྲིད་ནོར་གསེར་གོས་དང་རིན་ཆེན་གང་བའི་ཤིང་རྟ་གླང་པོ་རླུང་མགྱོགས་ཤུགས་ལྡན་རྟ་ཕོ་རྩལ་མཆོག་ལྡན་པ་བཏང་།
en: I have given up my head and my beloved wife and children, My kingdom, wealth, gold, and clothes, “Elephants and horses laden with jewels, Swift as the wind and of great power.

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་མང་ནས་ཚུལ་ཁྲིམས་ངས་བསྲུངས་བཟོད་པ་ཡོངས་བསྒོམས་བརྩོན་འགྲུས་སྟོབས་དང་བསམ་གཏན་ཤེས་རབ་དག །དེ་ལྟ་མོད་ཀྱི་བྱང་ཆུབ་ཞི་བ་ཤིས་པ་ཐོབ་ནས་རྒ་ཤིའི་རྒྱ་མོར་ཆུད་པའི་སེམས་ཅན་ང་ཡིས་ཡོངས་སུ་དགྲོལ་བའི་དུས་ལ་བབ།
en: For trillions of eons I have trained in discipline and patience, Delighting in diligence, the powers, concentration, and knowledge. “Therefore, once I attain the auspicious peace of awakening, The time has come for me to free beings drowning in the ocean of old age and death.”

source: །འདུན་པས་སྨྲས་པ། ཇོ་ཇོ་ཁྱོད་བལྟམ་མ་ཐག་ཏུ་བལྟ་བའི་ཕྱིར་བྲམ་ཟེ་ལྟས་མཁན་རྣམས་ལ་བསྟན་ན། དེ་དག་གིས་ཁྱོད་རྒྱལ་པོ་ཟས་གཙང་མའི་སྤྱན་སྔར་ལྷ་ཁྱོད་ཀྱི་རྒྱལ་པོའི་ཕོ་བྲང་འཕེལ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཅེས་བདག་གིས་ཐོས་སོ། །
en: Chanda replied, “I have heard, my Lord, that when you were born, you were brought to the priests who are skilled in making predictions based on examining signs. They prophesied before your father, King Śuddhodana, ‘Your Majesty, your royal line will flourish.’

source: སྨྲས་པ། ཇི་ལྟ་བུར་འགྱུར། སྨྲས་པ་གཞོན་ནུ་འདི་ནི་བསོད་ནམས་བརྒྱ་མཚན་ལྡན། །ཁྱོད་ཀྱི་བུ་བཙས་བསོད་ནམས་གཟི་བརྗིད་ཅན།
en: When King Śuddhodana inquired further, the priests replied: “ ‘Your newborn son possesses a hundred marks of merit And blazes with the splendor of merit.

source: །དེ་ནི་གླིང་བཞིའི་དབང་ཕྱུག་འཁོར་ལོས་སྒྱུར།
en: He will become a universal monarch, ruling over the four continents,

source: །ནོར་བདུན་དང་ནི་རབ་ཏུ་ལྡན་པར་འགྱུར།
en: And he will possess the seven treasures.

source: །གལ་ཏེ་འཇིག་རྟེན་སྡུག་བསྔལ་བལྟས་ནས་ནི།
en: “ ‘However, if he is confronted with the miseries of this world,

source: །བཙུན་མོའི་འཁོར་སྤངས་མངོན་པར་བྱུང་འགྱུར་ན།
en: He will abandon his retinue of consorts and leave his home.

source: །བྱང་ཆུབ་རྒ་ཤི་མེད་པའི་གནས་ཐོབ་སྟེ།
en: Then he will attain awakening, the state free from old age and death.

source: །ཆོས་ཀྱི་ཆུ་ཡིས་སྐྱེ་དགུ་འདི་ཚིམ་བྱེད།
en: He will satisfy beings with the water of the Dharma.’

source: །ཇོ་ཇོ་ལུང་བསྟན་པ་འདི་ནི་མཆིས་ཏེ།
en: “My Lord, there is this prophecy and it cannot be denied.

source: འདི་མ་མཆིས་པ་ནི་མ་ལགས་མོད་ཀྱི་འོན་ཀྱང་ཕན་པར་འཚལ་བ་བདག་གི་ཚིག་གསན་པར་གསོལ།
en: But please listen to what I have to say, for I may be able to help you!”

source: སྨྲས་པ། ཅི་ཞིག །
en: “How so?” asked the Bodhisattva.

source: སྨྲས་པ། ལྷ་ཅིག་གང་གི་དོན་དུ་འདི་ན་ཁ་ཅིག་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་རྣམ་པ་དུ་མ་རྩོམ་སྟེ།
en: Chanda replied, “My Lord, why is it that some people go through disciplined actions and practice austerities?

source: རི་དགས་ཀྱི་པགས་པ་དང་། རལ་པའི་ཐོར་ཚུགས་དང་། རྩྭ་དང་ཤིང་ཤུན་གྱོན་པ་དང་། སེན་མོ་དང་། སྐྲ་དང་། ཨག་ཙོམ་རིང་པོར་འཇོག་པ་དང་། ལུས་ལ་གདུང་བ་དང་། ཡོངས་སུ་གདུང་བ་རྣམ་པ་དུ་མ་སྤྲོ་བར་བགྱིད་དེ།
en: They wear deerskin and tie their hair in a topknot. They wear garments made of tree bark. They let their nails, hair, and beard grow long. They take pleasure in torturing their bodies and go through various difficult torments.

source: བདག་ཅག་ཇི་ལྟར་ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་འཐོབ་པར་འགྱུར་ཞེས་བརྟུལ་ཞུགས་དང་དཀའ་ཐུབ་དྲག་པོ་རྩོམ་མོ།
en: They take up the harshest of austerities because, as they say, they wish to attain the best among gods and humans.

source: །ཇོ་ཇོ་ཕུན་སུམ་ཚོགས་པ་དེ་ནི་ཁྱོད་ཀྱིས་བརྙེས་ལགས་ཏེ།
en: But you, Lord, you already possess this good fortune!

source: རྒྱལ་སྲིད་འབྱོར་ཅིང་རྒྱས་ལ་བདེ་ཞིང་ལོ་ལེགས་ཏེ།
en: “The kingdom is prosperous, large, and peaceful, with excellent harvests.

source: ཉམས་དགའ་ཞིང་མི་དང་སྐྱེ་བོ་མང་པོས་གང་བ་འདི་དང་། སྐྱེད་མོས་ཚལ་དམ་པ་མཆོག་མེ་ཏོག་དང་འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ། བྱའི་ཚོགས་སྣ་ཚོགས་སྒྲ་སྐད་ཡིད་དུ་འོང་བ་འབྱིན་པ་འདི་དག་དང་།
en: It is delightful and filled with many people. Your parks are the best of the best, full of flowers and fruits and resounding with the singing of birds.

source: རྫིང་མེ་ཏོག་ཨུད་པ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོས་མཛེས་པར་གྱུར་པ། ངང་པ་དང་། རྨ་བྱ་དང་། ཁུ་བྱུག་དང་། ངུར་པ་དང་། ཁྲུང་ཁྲུང་དང་། ངང་སྐྱ་སྒྲ་སྐད་འབྱིན་པ།
en: There are beautiful ponds with blue, pink, and white lotus flowers, and they resound with the cries of swans, peacocks, cuckoos, wild ducks, storks, and whooper swans.

source: ཤིང་ཨ་མྲ་དང་། མྱ་ངན་འཚང་དང་། ཙམ་པ་ཀ་དང་། ཀུ་ར་བ་ཀ་དང་། ཀེ་ས་ར་ལ་སོགས་པ་ཤིང་མེ་ཏོག་ཆགས་པ་སྣ་ཚོགས་ཀྱིས་འགྲམ་འཁོར་བ།
en: There are many flowering trees growing around the lakes, such as mango, aśoka, campaka, amaranth, and saffron trees.

source: རིན་པོ་ཆེའི་ཤིང་སྣ་ཚོགས་ཀྱི་ཕྲེང་གིས་ལེགས་པར་བརྒྱན་པ། མིག་མངས་རིས་སུ་བཀོད་པ། རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་སྟེགས་བུས་བསྐོར་བ།
en: The parks are adorned with groves of jeweled trees that are arranged like chessboards and surrounded by jewel platforms.

source: རིན་པོ་ཆེའི་དྲ་བ་བྲེས་པ།
en: One sees jeweled lattices hanging everywhere.

source: དུས་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་སྤྱད་པ། དགུན་དང་། དབྱར་དང་། སྟོན་དང་། དཔྱིད་གནས་བདེ་བ་རྣམས་དང་། ཁང་བཟངས་ཆེན་པོ་ཆོས་དང་། ཆོས་བཟང་དང་། བདེ་བ་དང་། མྱ་ངན་བྲལ་བ་ལ་སོགས་པ་རྣམ་པར་རྒྱལ་བའི་ཁང་པ་ལྟ་བུ་སྟོན་ཀའི་སྤྲིན་འདྲ་བ།
en: The parks can be enjoyed during any season, and they are pleasant to visit whether it is the hot season, the rainy season, autumn, or winter. “Your palaces are like the palace of Vaijayanta, wherein one finds the peace of true Dharma, and all one’s worries are gone.
